#include <stdio.h>

int main()
{
    char num1 = 113; // 0111 0001
    char num2 = -15; // 15:0000 1111 ->1의보수:1111 0000->2의보수(1더하기) 1111 0001 => -15
    char num3, num4, num5, num6;

    num3 = num1 << 2; //1100 0100 => 시프트연산으로 부호비트가 1로 변하므로 음수가 됨.
    num4 = num2 << 2; // 1100 0100

    num5 = num1 << 4; //0001 0000
    num6 = num2 << 4; //0001 0000 => 시프트 연산을 하면서 제일 첫번쨰 비트인 부호비트가 0으로 변하므로 양수가 된다.

    printf("%d\n", num3);
    /* 1100 0100 (음수)
        =>(-1해주기)1100 0011 
        =>(반전) 0011 1100 => 4+8+16+32 = 60 
        =>(-1곱하기) -60 
    */

    printf("%d\n", num4);
    /* 1100 0100 (음수)
        => 1100 0011
        => 0011 1100 => 4+8+16+32 = 60
        => -60
    
    */

    printf("%d\n", num5); // 0001 0000 (양수)=> 16 
    printf("%d\n", num6); // 0001 0000 (양수)=> 16

    return 0;
}